{
  "backend/main.mo": "Main Motoko actor for the Ayurvedic store backend, implementing stock management, sales tracking, user profiles with trial status, and role-based access control using admin/user permissions.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (mobile navigation overlay, menu layout, close button, body scroll lock) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key details of every component, page, hook, and config file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS design tokens for light and dark themes, including colors for background, foreground, sidebar, charts, and UI primitives.",
  "frontend/index.html": "HTML entry point for the Bevinamarada Ayurvedic Store SPA, setting metadata, favicon, Google Fonts preconnect, and mounting the React app via `/src/main.tsx`.",
  "frontend/src/App.tsx": "Root React app component that configures TanStack Router with public routes (Home, About, Contact under PublicLayout) and protected admin routes (dashboard, stocks, customers, sales, etc. under AdminGuard/AdminLayout), wrapped with QueryClient and ThemeProvider.",
  "frontend/src/components/AdminGuard.tsx": "Authentication guard component that enforces Internet Identity login, shows a profile setup modal for new users, and blocks access for non-admin principals before rendering admin children.",
  "frontend/src/components/AdminLayout.tsx": "Defines the admin panel layout with a sidebar navigation, profile dropdown (with logout, copy principal, and view profile actions), and responsive mobile menu for authenticated admin users.",
  "frontend/src/components/CustomerGuard.tsx": "Empty file, likely a placeholder for a route guard component that restricts access to customer-only routes.",
  "frontend/src/components/IncomeTracking.tsx": "Displays today's, monthly, and total income metrics in INR using sales report and today's sales data, with loading skeletons while fetching.",
  "frontend/src/components/Layout.tsx": "Empty file, likely a placeholder for a shared layout wrapper component.",
  "frontend/src/components/LowStockWarning.tsx": "Shows a warning card listing stock items at or below their low-stock threshold, or a healthy status card if all stock levels are sufficient.",
  "frontend/src/components/ProductForm.tsx": "Empty file, likely a placeholder for a product creation/editing form component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file, likely a placeholder for a modal component used during initial user profile setup.",
  "frontend/src/components/PublicLayout.tsx": "Provides the public-facing page layout with a sticky header, desktop and full-screen mobile navigation, and a footer for the Bevinamarada Ayurvedic Store site.",
  "frontend/src/components/RevenueOverview.tsx": "Displays total and monthly revenue summary cards along with a sorted product breakdown list showing units sold per product.",
  "frontend/src/components/StockItemForm.tsx": "A dialog form for adding or editing stock items, supporting fields like name, category, quantity, price, expiry date, and image upload, with validation and mutation hooks.",
  "frontend/src/components/TodaysSalesPanel.tsx": "Displays today's sales summary (total revenue and units sold) and a scrollable list of individual sale transactions, with loading skeletons while data is fetched.",
  "frontend/src/components/TrendingProducts.tsx": "Empty file with no content or exports.",
  "frontend/src/components/TrendingStocksPanel.tsx": "Renders a ranked list of trending stock items with image, name, category, and price, fetched via useGetTrendingStockItems, with loading skeletons and an empty state.",
  "frontend/src/components/TrialStatusBanner.tsx": "Shows a top-of-page banner indicating the user's trial status—urgent warning when expiring soon, or a hard-stop message when the trial has expired.",
  "frontend/src/components/TrialStatusCard.tsx": "Displays a styled card showing trial active/expired status, days remaining, and expiry date, with color-coded urgency states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage Internet Identity authentication state (login, logout, identity persistence) via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including stock items (CRUD, trending, low-stock, expiring) and sales, using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, defines CSS custom properties for light/dark themes using OKLCH colors, and declares reusable component classes for gradients, cards, buttons, and tables.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts it to the DOM.",
  "frontend/src/pages/AboutUs.tsx": "Static About Us page for the Bevinamarada Ayurvedic Store, displaying a hero section, company story, and explanation of the Neem tree brand identity.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying phone, WhatsApp, and address info alongside a simulated contact form with submission state handling.",
  "frontend/src/pages/CustomerManagement.tsx": "Admin page for managing customers and enquiries using localStorage, supporting add/edit/delete operations, search filtering, repeat-customer tracking, and per-customer enquiry logging.",
  "frontend/src/pages/EnquiryManagement.tsx": "Empty file with no content.",
  "frontend/src/pages/Home.tsx": "Public-facing home page featuring a hero banner, product category grid, and trust indicators for the Bevinamarada Ayurvedic Store.",
  "frontend/src/pages/IncomePage.tsx": "Admin income tracking page that renders the IncomeTracking component with a back-to-dashboard link and page header.",
  "frontend/src/pages/LoginWelcome.tsx": "Empty file with no content.",
  "frontend/src/pages/OwnerDashboard.tsx": "Admin dashboard page displaying key metric cards (total products, low stock, today's revenue, trending items, customers, sales reports) with links to sub-pages, fetched via React Query hooks.",
  "frontend/src/pages/ProductManagement.tsx": "Empty file with no content.",
  "frontend/src/pages/Products.tsx": "Empty file with no content.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page allowing the logged-in admin to view and edit their display name, see their principal ID, role badge, and trial status with days remaining.",
  "frontend/src/pages/RevenuePage.tsx": "Simple page wrapper that renders the RevenueOverview component with a back-to-dashboard link and page header.",
  "frontend/src/pages/SalesPage.tsx": "Simple page wrapper that renders the TodaysSalesPanel component with a back-to-dashboard link and page header.",
  "frontend/src/pages/SalesReports.tsx": "Sales reports page with tabbed views for daily, monthly, and product-level breakdowns, plus a print/download feature that generates a formatted HTML report.",
  "frontend/src/pages/StockManagement.tsx": "Full-featured stock management page supporting filtering by status (all, low, out-of-stock, expiring, expired), search, add/edit via a form modal, delete confirmation, trending toggle, and quick-sale recording.",
  "frontend/src/pages/TrendingPage.tsx": "Simple page wrapper that renders the TrendingStocksPanel component with a back-to-dashboard link and page header.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (including from hash-based routes), persist them to sessionStorage, retrieve them, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based color tokens, font families (Poppins, Inter, JetBrains Mono), border radii, box shadows, and keyframe animations.",
  "project_state.json": "Project state descriptor for the Bevinamarada Ayurvedic Store app, recording existing features, known issues (broken mobile nav overlay), architectural notes, and metadata for a fix request targeting the mobile navigation menu."
}