{
  "backend/main.mo": "Main Motoko actor implementing a product inventory and sales management system with authorization, blob storage, and CRUD operations for products, customers, sales orders, enquiries, and user profiles.",
  "feature_evidence.json": "Feature evidence report documenting the bold font weight applied to the login button in AdminGuard.tsx, linked to test ID REQ-15.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, and configuration for an Ayurvedic store with customer and admin interfaces.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining an Ayurvedic color palette using OKLCH values for light and dark themes.",
  "frontend/index.html": "HTML entry point for the Bevinamarada Ayurvedic Store React application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with customer-facing routes (home, products, about, contact) and admin routes (dashboard, products, customers, enquiries, reports) wrapped in appropriate layouts.",
  "frontend/src/components/AdminGuard.tsx": "Authentication guard component that enforces Internet Identity login, handles new user profile setup, verifies admin role, and displays appropriate screens with a bold-styled login button.",
  "frontend/src/components/AdminLayout.tsx": "Admin panel layout with responsive sidebar navigation, mobile menu toggle, and logout functionality for accessing dashboard, products, customers, enquiries, and reports.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation menu (desktop and mobile), and Ayurvedic branding. Conditionally shows admin panel link for authenticated admin users.",
  "frontend/src/components/ProductForm.tsx": "Dialog form component for adding or editing products with fields for name, category, price, quantity, and image URL. Handles form submission via mutations and displays loading states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on products, customers, enquiries, and admin dashboard data. Each mutation includes cache invalidation and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Ayurvedic color palette (sage greens and earth browns) defined using OKLCH color space for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AboutUs.tsx": "Displays the About Us page with the store's story, values (Authenticity, Quality, Expertise, Care), and a hero image of traditional Ayurvedic medicine. Includes sections explaining the Bevinamarada name origin and commitment to authentic Ayurvedic products.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing key metrics including today's/monthly/total income, total products, out-of-stock items, and low-stock products. Fetches data from useGetAdminDashboard and useGetAllProducts hooks and displays them in metric cards.",
  "frontend/src/pages/Contact.tsx": "Contact page with phone, WhatsApp, address, and business hours information displayed in cards. Includes an enquiry form that submits data via useAddEnquiry hook with name, phone, and message fields.",
  "frontend/src/pages/CustomerManagement.tsx": "Admin page for managing customers, displaying total and repeat customer counts. Shows a table of all customers with ability to mark new customers as repeat customers using useUpdateRepeatCustomerStatus mutation.",
  "frontend/src/pages/EnquiryManagement.tsx": "Admin page for viewing customer enquiries with tabs for all enquiries and today's enquiries. Displays enquiry data in tables showing date/time, name, phone, and message with formatted timestamps.",
  "frontend/src/pages/Home.tsx": "Landing page component featuring a hero section with call-to-action buttons for phone and WhatsApp, trust indicators with icons, and promotional content for an Ayurvedic store.",
  "frontend/src/pages/ProductManagement.tsx": "Admin page for managing products with a table view showing product details, inline edit/delete/hide actions, and a modal form for adding or editing products with confirmation dialogs.",
  "frontend/src/pages/Products.tsx": "Public-facing product catalog page displaying products in a responsive grid with images, prices, stock status badges, and enquiry buttons.",
  "frontend/src/pages/SalesReports.tsx": "Admin dashboard showing sales analytics with metric cards for daily/monthly/total sales and a product-wise sales breakdown list.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both standard query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, extended theme properties, custom animations, and plugin integrations for typography and animations.",
  "project_state.json": "Project state file tracking the Bevinamarada Ayurvedic Store website with admin system, documenting 13 implemented features including authentication, product management, sales reporting, customer tracking, and customer-facing pages. Defines architectural requirements for mobile-first design, two user roles (admin/customer), Ayurvedic theming, and future extensibility for payments, GST, and multilingual support."
}