{
  "backend/main.mo": "Main Motoko actor for the Ayurvedic store backend, implementing stock inventory, sales tracking, user profiles, trial status, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated files, components, test IDs, and confidence levels, covering UI theme replacement, font updates, and contrast fixes.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose, components, and notable implementation details for build planning reference.",
  "frontend/index.css": "Root Tailwind CSS entry point that defines OKLCH-based CSS custom property design tokens for light and dark themes, including colors for background, foreground, card, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the React app, setting metadata, favicon, theme color, Google Fonts preconnect links, and mounting the root div with the main.tsx module script.",
  "frontend/src/App.tsx": "Defines the full TanStack Router route tree with public pages under PublicLayout, a standalone admin login route, and all admin pages nested under AdminGuard then AdminLayout.",
  "frontend/src/components/AdminGuard.tsx": "Authentication guard component that checks both sessionStorage and localStorage for valid admin session keys, redirecting to /admin-login if absent or rendering nested routes via Outlet if authenticated.",
  "frontend/src/components/AdminLayout.tsx": "Defines the admin panel layout with a responsive sidebar navigation, logout functionality, and active route highlighting using TanStack Router.",
  "frontend/src/components/CustomerGuard.tsx": "Empty file, likely a placeholder for a route guard component restricting access to customer-only routes.",
  "frontend/src/components/IncomeTracking.tsx": "Displays today's, monthly, and total income cards along with a monthly breakdown table using sales report data from query hooks.",
  "frontend/src/components/Layout.tsx": "Empty file, likely a placeholder for a shared layout wrapper component.",
  "frontend/src/components/LowStockWarning.tsx": "Shows an alert banner listing up to five low-stock items with a link to the stock management page.",
  "frontend/src/components/ProductForm.tsx": "Empty file, likely a placeholder for a product creation or editing form component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Renders a modal dialog prompting new users to enter their name and save a profile before proceeding.",
  "frontend/src/components/PublicLayout.tsx": "Provides the public-facing site layout with a sticky header, top info bar, responsive mobile navigation, and a footer area using TanStack Router's Outlet.",
  "frontend/src/components/RevenueOverview.tsx": "Displays total and monthly revenue cards plus a top-products breakdown table sourced from sales report and stock item queries.",
  "frontend/src/components/StockItemForm.tsx": "A form modal for adding or editing stock items, supporting image upload with progress tracking, expiry dates, and category selection.",
  "frontend/src/components/TodaysSalesPanel.tsx": "Displays today's sales summary (revenue, transaction count, units sold) as stat cards plus a detailed transactions table, fetching data via useGetTodaysSales and useGetAllStockItems hooks.",
  "frontend/src/components/TrendingProducts.tsx": "Public-facing section that renders a grid of trending stock items with images, prices, and an enquiry link, using the useGetTrendingStockItems hook with skeleton loading states.",
  "frontend/src/components/TrendingStocksPanel.tsx": "Admin panel component that filters all stock items for those marked as trending and displays them in a responsive card grid with image, category, price, and stock quantity.",
  "frontend/src/components/TrialStatusBanner.tsx": "Placeholder component for a trial status banner that renders nothing, kept to avoid breaking AdminLayout imports.",
  "frontend/src/components/TrialStatusCard.tsx": "Placeholder component for a trial status card that renders nothing, kept to avoid breaking any imports.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control with an admin token and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage ICP Internet Identity authentication state (login, logout, identity persistence) via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the application, exposing queries and mutations for user profiles, stock items (CRUD, trending, low-stock, expiring), and sales data against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, sets up Tailwind directives, defines CSS custom properties for light/dark themes using oklch colors, and adds utility classes for pharma-specific gradients and card styles.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutUs.tsx": "Static About Us page for an Ayurvedic store featuring a hero section, company story with image, and a four-value grid (Natural, Compassion, Quality, Community) with icons.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard overview page that renders a grid of navigation cards linking to sub-sections like Stock Management, Products, Customers, Sales Reports, Revenue, and Trending Products.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with a hardcoded credential check (username 'baslxr', password 'bas12345') that sets a session storage flag and navigates to the owner dashboard on success.",
  "frontend/src/pages/Contact.tsx": "Contact page with store info, a lazy-loaded Google Maps iframe (using IntersectionObserver), and an enquiry form that saves submissions to localStorage.",
  "frontend/src/pages/CustomerManagement.tsx": "Admin customer management page supporting CRUD operations for customers and enquiries, with tabbed filtering (all, repeat, enquiries) and localStorage persistence.",
  "frontend/src/pages/EnquiryManagement.tsx": "Admin page that loads customer product enquiries from localStorage and displays them in a tabbed view (All vs Today's), showing customer name, product, message, and date.",
  "frontend/src/pages/Home.tsx": "Public-facing home page featuring a hero section, stats bar, feature highlights, testimonials, and a TrendingProducts component for the pharmacy storefront.",
  "frontend/src/pages/IncomePage.tsx": "Admin page wrapper that renders the IncomeTracking component with a back-navigation header for the income tracking section.",
  "frontend/src/pages/LoginWelcome.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/OwnerDashboard.tsx": "Admin overview dashboard displaying key business metrics (revenue, sales, stock, low-stock alerts) as clickable cards fetched via React Query hooks, plus a low-stock warning and quick-action links.",
  "frontend/src/pages/ProductManagement.tsx": "Admin page for managing the product catalog with search, a data table showing stock items, and actions to add, edit, delete, or mark items as trending via API hooks.",
  "frontend/src/pages/Products.tsx": "Public products page that currently shows a placeholder 'coming soon' message with a link to the contact page.",
  "frontend/src/pages/ProfilePage.tsx": "User profile settings page that fetches and allows updating the logged-in user's display name via a form, with save confirmation feedback.",
  "frontend/src/pages/RevenuePage.tsx": "Admin page wrapper that renders the RevenueOverview component with a back-navigation header.",
  "frontend/src/pages/SalesPage.tsx": "Admin page wrapper that renders the TodaysSalesPanel component with a back-navigation header for viewing today's sales.",
  "frontend/src/pages/SalesReports.tsx": "Sales reports page with daily/monthly/per-product tabs, summary cards for total revenue and sales, and a PDF export feature that opens a print-ready HTML window.",
  "frontend/src/pages/StockManagement.tsx": "Stock management page with filterable tabs (all, low-stock, trending, out-of-stock), search, and actions to add, edit, delete, sell, or mark items as trending.",
  "frontend/src/pages/TrendingPage.tsx": "Simple page that displays the TrendingStocksPanel component with a back-link to the admin route, styled with a neon-black background.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a pharma-grade light theme with oklch color tokens, custom pharma color palette, box shadows, border radii, fonts (Inter/Poppins), and animation keyframes.",
  "project_state.json": "Project state metadata tracking the pharmacy management app's version, known UI contrast issues, a theme migration from cyber/neon to pharma-grade light UI, and admin credentials."
}