{
  "backend/main.mo": "Main Motoko actor for the Bevinamarada Ayurvedic Store backend, implementing user profile management, stock inventory CRUD, sales recording, trial status tracking, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping three admin login/auth features (standalone login page, remember-me checkbox, and protected admin routes) to their implementing files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose and key details of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including colors for backgrounds, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React app, setting metadata, favicon, theme color, and Google Fonts preconnect for the Bevinamarada Ayurvedic Store.",
  "frontend/src/App.tsx": "Root React app component that defines the full TanStack Router route tree, separating public routes (/, /about, /contact) under PublicLayout, a standalone /admin-login route, and all /admin/* routes protected by AdminGuard and wrapped in AdminLayout.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks sessionStorage for an active admin session (redirecting to /admin-login if absent), then handles Internet Identity authentication, profile setup, and admin role verification before rendering child routes.",
  "frontend/src/components/AdminLayout.tsx": "Defines the admin panel layout with a sidebar navigation, mobile menu, profile dropdown, and logout functionality for the Bevinamarada Ayurvedic Store admin portal.",
  "frontend/src/components/CustomerGuard.tsx": "Empty file, likely a placeholder for a route guard component restricting access to customer-only routes.",
  "frontend/src/components/IncomeTracking.tsx": "Displays today's, monthly, and total income as gradient cards using sales report and today's sales query data.",
  "frontend/src/components/Layout.tsx": "Empty file, likely a placeholder for a shared layout component.",
  "frontend/src/components/LowStockWarning.tsx": "Shows an alert panel listing stock items below their threshold, with a link to the stock management page.",
  "frontend/src/components/ProductForm.tsx": "Empty file, likely a placeholder for a product creation/editing form component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name and saves their profile with a default user role on first login.",
  "frontend/src/components/PublicLayout.tsx": "Public-facing layout with a sticky header, top contact bar, desktop and mobile navigation, and an outlet for page content.",
  "frontend/src/components/RevenueOverview.tsx": "Displays total and monthly revenue summary cards alongside a top-products breakdown list using sales report and stock item data.",
  "frontend/src/components/StockItemForm.tsx": "Dialog form for adding or editing a stock item, supporting fields for name, category, quantity, price, expiry date, and image upload.",
  "frontend/src/components/TodaysSalesPanel.tsx": "Displays a dashboard panel showing today's sales summary (total revenue and units sold) along with a scrollable list of individual transactions, with loading skeletons while data fetches.",
  "frontend/src/components/TrendingProducts.tsx": "Renders a public-facing grid of trending Ayurvedic stock items with images, prices, and an 'Enquire Now' link, showing skeletons during loading and hiding itself if no trending items exist.",
  "frontend/src/components/TrendingStocksPanel.tsx": "Displays a compact admin panel list of trending stock items with image, name, category, and price, showing skeletons while loading and an empty state if no trending items are found.",
  "frontend/src/components/TrialStatusBanner.tsx": "Shows a top-of-page banner indicating the active trial period's remaining days, with urgent red styling when 2 or fewer days remain.",
  "frontend/src/components/TrialStatusCard.tsx": "Renders a card widget showing trial status (active, expiring soon, or ended) with appropriate icons and color coding based on days remaining.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and exposing login status states to the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the application, covering CRUD mutations and data-fetching queries for stock items, sales, user profiles, and trial status via the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, defines CSS custom properties for light/dark themes using OKLCH colors, and declares reusable component classes for gradients, cards, buttons, and tables.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutUs.tsx": "Static About Us page displaying a hero section, company story with an image, and a four-value grid (Natural, Compassion, Quality, Community) for the Bevinamarada Ayurvedic Store.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard landing page that renders three navigation cards linking to Stock, Customers, and Sales Reports sections of the admin panel.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with hardcoded credentials, remember-me functionality via localStorage, session tracking via sessionStorage, and redirect logic using TanStack Router.",
  "frontend/src/pages/Contact.tsx": "Contact page with store info cards (phone, email, address, hours), an embedded Google Maps iframe, and a contact form with a temporary submission success state.",
  "frontend/src/pages/CustomerManagement.tsx": "Admin customer management page that supports adding, editing, deleting, and searching customers, plus logging enquiries per customer, with all data persisted to localStorage.",
  "frontend/src/pages/EnquiryManagement.tsx": "Admin page that reads customer enquiries from localStorage and displays them in two tabs: all enquiries and today's enquiries.",
  "frontend/src/pages/Home.tsx": "Public-facing home page with a hero section, trending products component, and three trust-indicator cards (Natural, Quality, Award).",
  "frontend/src/pages/IncomePage.tsx": "Admin page wrapper that renders the IncomeTracking component with a back-to-dashboard link and page header.",
  "frontend/src/pages/LoginWelcome.tsx": "Empty file with no content.",
  "frontend/src/pages/OwnerDashboard.tsx": "Main admin dashboard showing metric cards (products, low stock, today's revenue, trending count) fetched via React Query hooks, plus a welcome banner.",
  "frontend/src/pages/ProductManagement.tsx": "Admin page for managing stock items with search, add/edit via StockItemForm dialog, delete, and mark-as-trending actions displayed in a table.",
  "frontend/src/pages/Products.tsx": "Empty file with no content.",
  "frontend/src/pages/ProfilePage.tsx": "Admin profile settings page that loads and saves the current user's display name via React Query mutations.",
  "frontend/src/pages/RevenuePage.tsx": "Admin page wrapper that renders the RevenueOverview component with a back-to-dashboard link and page header.",
  "frontend/src/pages/SalesPage.tsx": "Admin page wrapper that renders the TodaysSalesPanel component with a back-to-dashboard link and page header.",
  "frontend/src/pages/SalesReports.tsx": "React page that displays sales reports (daily, monthly, product breakdown) with tabs, loading skeletons, and a print/download feature formatting amounts in INR.",
  "frontend/src/pages/StockManagement.tsx": "React page for managing stock items with filter tabs (all, low, out-of-stock, expiring, expired), search, add/edit/delete actions, sale recording, and trending marking.",
  "frontend/src/pages/TrendingPage.tsx": "Simple page that renders the TrendingStocksPanel component with a back-link to the admin dashboard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a custom OKLCH color palette (saffron, teal, coral, gold, forest, sage), custom fonts, border radii, and box shadows.",
  "project_state.json": "Project state metadata for the Bevinamarada Ayurvedic Store, documenting existing features (admin login with hardcoded credentials, remember-me, route protection) and a pending feature request for admin portal login with credential saving."
}