{
  "backend/main.mo": "Main Motoko actor for the Bevinamarada Ayurvedic Store backend, implementing stock inventory management, sales tracking, user profiles with trial status, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting a single feature: reverting the entire project (frontend and backend) to Version 6 state, listing all affected files and component dependencies.",
  "frontend-file-summaries.txt": "JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, describing their purpose, key components, and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme design tokens including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Bevinamarada Ayurvedic Store React app, setting metadata, favicon, theme color, Google Fonts preconnect, and mounting the root div for the Vite/React application.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with public routes (home, about, contact) under PublicLayout and protected admin routes under AdminGuard/AdminLayout, wrapped with React Query and ThemeProvider.",
  "frontend/src/components/AdminGuard.tsx": "Authentication and authorization guard component for admin routes that handles Internet Identity login, profile setup modal display, loading states, and access-denied screens for non-admin users.",
  "frontend/src/components/AdminLayout.tsx": "Defines the admin panel layout with a sidebar navigation (desktop) and mobile menu, including profile dropdown and logout functionality using Internet Identity.",
  "frontend/src/components/CustomerGuard.tsx": "Empty file, likely a placeholder for a route guard component restricting access to customer-only routes.",
  "frontend/src/components/IncomeTracking.tsx": "Displays today's, monthly, and total income as gradient cards by fetching sales reports and today's sales data.",
  "frontend/src/components/Layout.tsx": "Empty file, likely a placeholder for a shared layout component.",
  "frontend/src/components/LowStockWarning.tsx": "Shows an alert panel listing stock items below their threshold, with a link to the stock management page.",
  "frontend/src/components/ProductForm.tsx": "Empty file, likely a placeholder for a product creation/editing form component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name and saves their profile via mutation before proceeding.",
  "frontend/src/components/PublicLayout.tsx": "Public-facing layout with a sticky header, top info bar, desktop/mobile navigation, and an Outlet for page content.",
  "frontend/src/components/RevenueOverview.tsx": "Displays total and monthly revenue summary cards plus a top-products breakdown list using sales report and stock item data.",
  "frontend/src/components/StockItemForm.tsx": "Dialog form for adding or editing a stock item, supporting fields like name, category, quantity, price, expiry date, and image upload.",
  "frontend/src/components/TodaysSalesPanel.tsx": "Displays a dashboard panel showing today's sales summary (total revenue and units sold) along with a scrollable list of individual transactions, with skeleton loading states.",
  "frontend/src/components/TrendingProducts.tsx": "Renders a public-facing grid of trending Ayurvedic stock items with images, prices, and an 'Enquire Now' link, including skeleton placeholders while loading.",
  "frontend/src/components/TrendingStocksPanel.tsx": "Displays an admin dashboard panel listing trending stock items with their image, category, price, and a 'Trending' badge, with skeleton and empty-state handling.",
  "frontend/src/components/TrialStatusBanner.tsx": "Shows a top-of-page banner indicating the remaining trial days, switching to an urgent red style when 2 or fewer days remain; hidden if no active trial.",
  "frontend/src/components/TrialStatusCard.tsx": "Renders a card widget showing trial status (active, expiring soon, or ended) with appropriate icon and color styling based on days remaining.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the backend actor, covering CRUD mutations and queries for stock items, sales, reports, user profiles, and trial status.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for light/dark themes, and declares reusable component classes like gradient backgrounds, admin cards, stat cards, buttons, and table styles.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutUs.tsx": "Static About Us page displaying a hero section, company story with an image, and a four-value grid (Natural, Compassion, Quality, Community) for the Bevinamarada Ayurvedic Store.",
  "frontend/src/pages/AdminDashboard.tsx": "Simple admin dashboard page that renders three navigation cards linking to the Stock, Customers, and Sales Reports admin sections.",
  "frontend/src/pages/Contact.tsx": "Contact page with store info cards (phone, email, address, hours), an embedded Google Maps iframe, and a controlled enquiry form that shows a success state on submission.",
  "frontend/src/pages/CustomerManagement.tsx": "Admin page for managing customers and enquiries stored in localStorage, supporting add/edit/delete customer operations, search/filter, repeat-customer tracking, and a per-customer enquiry form via dialogs.",
  "frontend/src/pages/EnquiryManagement.tsx": "Read-only admin page that loads public enquiries from localStorage and displays them in All and Today tabs using a simple card layout.",
  "frontend/src/pages/Home.tsx": "Public-facing home page featuring a hero section with Ayurvedic branding, a TrendingProducts component, and three trust-indicator cards (Natural, Quality Assured, Expert Guidance).",
  "frontend/src/pages/IncomePage.tsx": "Admin page that wraps the IncomeTracking component with a header and back-to-dashboard link, displaying all-time, monthly, and daily income summaries.",
  "frontend/src/pages/LoginWelcome.tsx": "Empty file with no content.",
  "frontend/src/pages/OwnerDashboard.tsx": "Admin dashboard overview page that fetches stock, low-stock, today's sales, and reports data, then renders metric cards linking to sub-pages like stock, sales, revenue, and customers.",
  "frontend/src/pages/ProductManagement.tsx": "Admin page for managing stock items with a searchable table supporting add, edit, delete, and mark-as-trending actions via a StockItemForm dialog.",
  "frontend/src/pages/Products.tsx": "Empty file with no content.",
  "frontend/src/pages/ProfilePage.tsx": "Admin profile settings page that loads and saves the current user's display name using query hooks, with a form and success feedback.",
  "frontend/src/pages/RevenuePage.tsx": "Admin page that wraps the RevenueOverview component with a header and back-to-dashboard link, showing total and monthly revenue breakdowns.",
  "frontend/src/pages/SalesPage.tsx": "Admin page that wraps the TodaysSalesPanel component with a header and back-to-dashboard link, listing all sales transactions recorded today.",
  "frontend/src/pages/SalesReports.tsx": "Admin sales reports page with tabbed views for daily, monthly, and per-product breakdowns, plus a print/download feature that generates a formatted HTML report.",
  "frontend/src/pages/StockManagement.tsx": "Full-page React component for managing stock items, supporting filtering by status (all, low, out, expiring, expired), search, add/edit/delete operations, sale recording, and trending marking with INR currency formatting.",
  "frontend/src/pages/TrendingPage.tsx": "Simple page component that displays the TrendingStocksPanel inside a styled container with a back-link to the admin route.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them to sessionStorage, and clean sensitive params from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a custom OKLCH-based color palette (saffron, teal, coral, gold, violet, forest, sage), custom fonts, border radii, and box shadows.",
  "project_state.json": "Project state metadata file recording schema version, a single existing feature (revert to Version 6), and configuration flags for clarification mode."
}