{
  "backend/main.mo": "Main Motoko actor for the Ayurvedic store backend, handling user profiles, stock inventory, sales, trial status, and access control using admin/user role-based permissions.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin portal routing, neon dark theme, etc.) to their associated source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each component, page, and utility in the React app.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom property design tokens for light and dark themes, applied globally to all components.",
  "frontend/index.html": "HTML entry point for the Bevinamarada Ayurvedic Store SPA, setting metadata, favicon, viewport, and mounting the React app at the root div.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with public routes under PublicLayout, a standalone admin-login route, and all admin routes nested under AdminGuard then AdminLayout.",
  "frontend/src/components/AdminGuard.tsx": "Authentication guard component that checks sessionStorage and localStorage for admin session keys, redirecting unauthenticated users to /admin-login and rendering nested routes via Outlet for authenticated users.",
  "frontend/src/components/AdminLayout.tsx": "Defines the admin panel layout with a fixed sidebar navigation (desktop) and mobile drawer, including nav links to all admin routes and a logout handler.",
  "frontend/src/components/CustomerGuard.tsx": "Empty file, likely a placeholder for a route guard component that restricts access to customer-only routes.",
  "frontend/src/components/IncomeTracking.tsx": "Displays today's, monthly, and total income as stat cards using sales report data, plus a monthly breakdown table.",
  "frontend/src/components/Layout.tsx": "Empty file, likely a placeholder for a shared layout wrapper component.",
  "frontend/src/components/LowStockWarning.tsx": "Shows an alert banner listing up to 5 low-stock items with a link to the stock management page; renders nothing if stock is sufficient.",
  "frontend/src/components/ProductForm.tsx": "Empty file, likely a placeholder for a product creation/editing form component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name to create a profile; blocks interaction until submitted.",
  "frontend/src/components/PublicLayout.tsx": "Public-facing layout with a sticky header, desktop nav links, and a full-screen mobile menu overlay wrapping page content via Outlet.",
  "frontend/src/components/RevenueOverview.tsx": "Displays total and monthly revenue cards along with a top-products breakdown table sourced from sales reports and stock data.",
  "frontend/src/components/StockItemForm.tsx": "Dialog form for adding or editing a stock item, handling fields like name, category, quantity, price, expiry, image upload with progress, and trending flag.",
  "frontend/src/components/TodaysSalesPanel.tsx": "Displays today's sales summary (revenue, transaction count, units sold) as stat cards plus a detailed transactions table, fetching data via useGetTodaysSales and useGetAllStockItems hooks.",
  "frontend/src/components/TrendingProducts.tsx": "Public-facing section that renders a grid of trending stock items with images, prices, and an enquiry link, using the useGetTrendingStockItems hook with skeleton loading states.",
  "frontend/src/components/TrendingStocksPanel.tsx": "Admin panel component that filters all stock items for those marked as trending and displays them in a responsive card grid with image, category, price, and stock quantity.",
  "frontend/src/components/TrialStatusBanner.tsx": "Stub component that renders nothing; the trial status banner feature is disabled in this version to prevent import errors in AdminLayout.",
  "frontend/src/components/TrialStatusCard.tsx": "Stub component that renders nothing; the trial status card feature is disabled in this version to prevent import errors.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control with an admin token and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage ICP Internet Identity authentication state (login, logout, identity persistence) via AuthClient with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks (queries and mutations) for all backend operations including user profiles, stock items (CRUD, trending, low-stock, expiring), and sales data.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Orbitron, Rajdhani, Share Tech Mono), sets up Tailwind directives, and defines a neon dark (black & green) theme with CSS custom properties, utility classes for neon glows, borders, scanlines, and grid backgrounds.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutUs.tsx": "Static About Us page for the Bevinamarada Ayurvedic Store displaying a hero section, company story, and a grid of core values (Natural, Compassion, Quality, Community) with icons.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin portal landing page that renders a grid of navigation cards linking to all admin sub-modules (stock, products, sales, revenue, customers, etc.) with a neon dark UI theme.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with hardcoded credentials (admin/admin123) that stores session state in sessionStorage and optionally localStorage, then navigates to the owner dashboard on success.",
  "frontend/src/pages/Contact.tsx": "Contact page with store info, a lazy-loaded Google Maps iframe (using IntersectionObserver), and an enquiry form that saves submissions to localStorage.",
  "frontend/src/pages/CustomerManagement.tsx": "Admin page for managing customers and enquiries with localStorage persistence, supporting CRUD operations on customers, enquiry logging, visit count tracking, and search/filter across tabs (all, repeat, enquiries).",
  "frontend/src/pages/EnquiryManagement.tsx": "Admin page that loads customer enquiries from localStorage and displays them in a tabbed view (All vs Today's), showing customer name, product, message, and date.",
  "frontend/src/pages/Home.tsx": "Public-facing landing page featuring a hero section with CTAs, trust indicators, stats, and a TrendingProducts component, styled with a neon/dark theme.",
  "frontend/src/pages/IncomePage.tsx": "Admin page wrapper that renders the IncomeTracking component with a back-navigation header.",
  "frontend/src/pages/LoginWelcome.tsx": "Empty file with no content.",
  "frontend/src/pages/OwnerDashboard.tsx": "Admin dashboard displaying key metrics (products, sales, revenue, low stock) fetched via React Query hooks, with quick-navigation links to all admin sub-pages and a low-stock alert banner.",
  "frontend/src/pages/ProductManagement.tsx": "Admin page for managing the product catalog with search, a data table showing stock items, and actions to add, edit, delete, or mark items as trending via React Query mutations.",
  "frontend/src/pages/Products.tsx": "Public products page that currently shows a placeholder 'coming soon' message with a link to the contact page.",
  "frontend/src/pages/ProfilePage.tsx": "User profile settings page that fetches and saves the caller's profile name via React Query, displaying a form with a save confirmation state.",
  "frontend/src/pages/RevenuePage.tsx": "Admin page wrapper that renders the RevenueOverview component with a back-navigation header.",
  "frontend/src/pages/SalesPage.tsx": "Admin page wrapper that renders the TodaysSalesPanel component with a back-navigation header.",
  "frontend/src/pages/SalesReports.tsx": "Displays sales analytics with daily/monthly/per-product tabs, summary cards for total revenue and sales, and a PDF export feature that opens a print-ready HTML report in a new window.",
  "frontend/src/pages/StockManagement.tsx": "Admin page for managing inventory with filterable tabs (all, low-stock, trending, expiring), search, and actions to add, edit, delete, sell, or mark items as trending.",
  "frontend/src/pages/TrendingPage.tsx": "Simple admin page that renders the TrendingStocksPanel component with a back-navigation link and a header.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a neon dark theme with custom color tokens (neon greens, near-black surfaces), custom fonts (Orbitron, Rajdhani, Share Tech Mono), neon glow box shadows, and keyframe animations like pulseGlow and neonFlicker.",
  "project_state.json": "Project state metadata for the Bevinamarada Ayurvedic Store app, tracking known issues (admin portal visibility, neon theme application), existing features, and pending architectural requests for the admin portal and neon theme."
}