{
  "backend/main.mo": "Main Motoko actor for the Ayurvedic store backend, implementing stock inventory management, sales tracking, user profiles with trial status, and role-based access control using admin/user permissions.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: AdminGuard skeleton loading optimization, React Query stale-while-revalidate caching in useQueries.ts, and updated Google Maps link in the Contact page.",
  "frontend-file-summaries.txt": "Auto-generated summary document describing the purpose and key details of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting metadata, favicon, theme color, and Google Fonts preconnect for the Bevinamarada Ayurvedic Store.",
  "frontend/src/App.tsx": "Root React app component that configures TanStack Router with public routes (home, about, contact), a standalone admin login route, and guarded admin routes wrapped in AdminGuard and AdminLayout.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component for admin pages that checks session storage and Internet Identity authentication, shows a full-page skeleton while loading, and redirects unauthenticated or non-admin users.",
  "frontend/src/components/AdminLayout.tsx": "Defines the admin panel layout with a sidebar navigation, mobile menu, profile dropdown, and logout functionality using TanStack Router and Internet Identity authentication.",
  "frontend/src/components/CustomerGuard.tsx": "Empty file, likely a placeholder for a route guard component restricting access to customer-only routes.",
  "frontend/src/components/IncomeTracking.tsx": "Displays today's, monthly, and total income as gradient cards by fetching sales reports and today's sales data.",
  "frontend/src/components/Layout.tsx": "Empty file, likely a placeholder for a shared layout component.",
  "frontend/src/components/LowStockWarning.tsx": "Shows an alert panel listing stock items below their threshold, with a link to the stock management page.",
  "frontend/src/components/ProductForm.tsx": "Empty file, likely a placeholder for a product creation/editing form component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name and saves their profile with a default user role on first login.",
  "frontend/src/components/PublicLayout.tsx": "Public-facing layout with a sticky header, top info bar, desktop and mobile navigation, and an outlet for page content.",
  "frontend/src/components/RevenueOverview.tsx": "Displays total and monthly revenue summary cards alongside a top-products breakdown list using sales report and stock data.",
  "frontend/src/components/StockItemForm.tsx": "Dialog form for adding or editing a stock item, supporting fields for name, category, quantity, price, expiry date, and image upload.",
  "frontend/src/components/TodaysSalesPanel.tsx": "Displays a dashboard panel showing today's total revenue, units sold, and a scrollable list of individual sale transactions with item names fetched from stock data.",
  "frontend/src/components/TrendingProducts.tsx": "Renders a public-facing grid of trending Ayurvedic stock items with images, prices, and an 'Enquire Now' link, showing skeletons while loading.",
  "frontend/src/components/TrendingStocksPanel.tsx": "Displays a compact admin panel list of trending stock items with images, category, and price, with empty and loading states.",
  "frontend/src/components/TrialStatusBanner.tsx": "Shows a top-of-page banner warning about an active trial period, with urgent styling when 2 or fewer days remain.",
  "frontend/src/components/TrialStatusCard.tsx": "Renders a styled card indicating trial status (active, expiring soon, or ended) with days remaining, using color-coded urgency states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, initializing it with the user's Internet Identity or anonymously, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including stock items, sales, and user profiles, with shared cache configuration.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, defines CSS custom properties for light/dark themes using OKLCH colors, and declares reusable component utility classes for gradients, cards, buttons, and tables.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutUs.tsx": "Static About Us page displaying the store's hero section, origin story, and a grid of core values (Natural, Compassion, Quality, Community) with icons and styled cards.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard landing page that renders three navigation cards linking to Stock, Customers, and Sales Reports sections of the admin panel.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with a hardcoded username/password check, remember-me functionality via localStorage, session tracking via sessionStorage, and redirect to the admin panel on success.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying store info (phone, email, address, hours), an embedded Google Maps iframe, and a contact form with name, phone, email, and message fields.",
  "frontend/src/pages/CustomerManagement.tsx": "Admin page for managing customers and enquiries, with CRUD operations persisted to localStorage, search/filter, and dialogs for adding/editing customers and logging product enquiries.",
  "frontend/src/pages/EnquiryManagement.tsx": "Admin page that reads customer enquiries from localStorage and displays them in two tabs: all enquiries and today's enquiries.",
  "frontend/src/pages/Home.tsx": "Public home page featuring a hero section with Ayurvedic branding, a TrendingProducts component, and three trust-indicator cards.",
  "frontend/src/pages/IncomePage.tsx": "Admin page that wraps the IncomeTracking component with a header and a back-to-dashboard link.",
  "frontend/src/pages/LoginWelcome.tsx": "Empty file with no content.",
  "frontend/src/pages/OwnerDashboard.tsx": "Main admin dashboard displaying metric cards (products, low stock, today's revenue, trending items) fetched via React Query hooks, plus a welcome banner.",
  "frontend/src/pages/ProductManagement.tsx": "Admin page for managing stock items with search, add, edit, delete, and trending-toggle actions backed by React Query mutations and a StockItemForm dialog.",
  "frontend/src/pages/Products.tsx": "Empty file with no content.",
  "frontend/src/pages/ProfilePage.tsx": "Admin profile settings page that loads and saves the current user's display name via React Query hooks.",
  "frontend/src/pages/RevenuePage.tsx": "Admin page that wraps the RevenueOverview component with a header and a back-to-dashboard link.",
  "frontend/src/pages/SalesPage.tsx": "Admin page that wraps the TodaysSalesPanel component with a header and a back-to-dashboard link.",
  "frontend/src/pages/SalesReports.tsx": "Displays sales reports (daily, monthly, product breakdown) with tabbed views, INR formatting, and a print/download feature. Uses React Query hooks to fetch report and stock data with loading skeletons.",
  "frontend/src/pages/StockManagement.tsx": "Admin page for managing inventory with filter tabs (all, low, out-of-stock, expiring, expired), search, and actions for add/edit/delete/sale/trending. Uses multiple React Query hooks and a StockItemForm component.",
  "frontend/src/pages/TrendingPage.tsx": "Simple page that renders the TrendingStocksPanel component with a back-navigation link to the admin panel.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a custom OKLCH color palette (saffron, teal, coral, gold, forest, sage), custom fonts, border radii, and box shadows.",
  "project_state.json": "Project state metadata tracking existing features, known issues (slow admin login loading), and pending fix requests for the Bevinamarada Ayurvedic Store admin portal."
}