{
  "backend/main.mo": "Main Motoko actor for the Bevinamarada Ayurvedic Store backend, implementing user profile management, stock item CRUD, sales recording, revenue overview, and income summary with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping three mobile-responsive sidebar features (hide sidebar by default, full-width content, backdrop overlay) to their implementing file AdminLayout.tsx and associated test IDs.",
  "frontend-file-summaries.txt": "A JSON document summarizing each frontend source file's purpose, covering pages, components, hooks, styles, and configuration for the Bevinamarada Ayurvedic Store admin dashboard.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind directives and defines light/dark CSS custom properties for the shadcn-ui color system including background, foreground, sidebar, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Bevinamarada Ayurvedic Store' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React application component that defines the TanStack Router route tree for all admin pages (dashboard, stocks, trending, sales, revenue, income) wrapped in AdminGuard and AdminLayout, with dark theme enforced.",
  "frontend/src/components/AdminGuard.tsx": "Authentication and authorization guard component that handles Internet Identity login, profile setup for new users, admin role verification, and renders appropriate UI states (loading, login, profile setup, access denied) before granting access to children.",
  "frontend/src/components/AdminLayout.tsx": "Defines the admin panel layout with a collapsible sidebar, navigation links, mobile menu support, and logout functionality using Internet Identity.",
  "frontend/src/components/CustomerGuard.tsx": "Empty file with no content.",
  "frontend/src/components/IncomeTracking.tsx": "Displays all-time, monthly, and today's income as metric cards using data from the income summary query, with loading skeletons.",
  "frontend/src/components/Layout.tsx": "Empty file with no content.",
  "frontend/src/components/ProductForm.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/RevenueOverview.tsx": "Shows total and monthly revenue metric cards plus a per-product revenue breakdown table, with loading skeletons while data fetches.",
  "frontend/src/components/StockItemForm.tsx": "Modal form for adding or editing a stock item, supporting image upload with progress tracking and fields for name, category, quantity, price, and low-stock threshold.",
  "frontend/src/components/TodaysSalesPanel.tsx": "Displays today's order count and revenue summary cards alongside a transactions table showing sale details, with loading skeletons.",
  "frontend/src/components/TrendingProducts.tsx": "Empty file with no content.",
  "frontend/src/components/TrendingStocksPanel.tsx": "Renders a grid of trending stock items with product images, category badges, stock count, and price, fetched via the trending stock items query.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, stock items, sales, revenue, and income summaries.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, defines CSS custom properties for light/dark themes, and declares keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "Empty page component file for the About Us page.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty page component file for the Admin Dashboard page.",
  "frontend/src/pages/Contact.tsx": "Empty page component file for the Contact page.",
  "frontend/src/pages/CustomerManagement.tsx": "Empty page component file for the Customer Management page.",
  "frontend/src/pages/EnquiryManagement.tsx": "Empty page component file for the Enquiry Management page.",
  "frontend/src/pages/Home.tsx": "Empty page component file for the Home page.",
  "frontend/src/pages/IncomePage.tsx": "Page that displays the IncomeTracking component with a header and back-navigation link to the admin dashboard.",
  "frontend/src/pages/LoginWelcome.tsx": "Empty page component file for the Login/Welcome page.",
  "frontend/src/pages/OwnerDashboard.tsx": "Owner dashboard page showing key business metrics (stock, sales, revenue, income) as cards and embedding trending stocks, today's sales, income tracking, and revenue overview panels.",
  "frontend/src/pages/ProductManagement.tsx": "Empty page component file for the Product Management page.",
  "frontend/src/pages/Products.tsx": "Empty page component file for the Products page.",
  "frontend/src/pages/RevenuePage.tsx": "Page that displays the RevenueOverview component with a header and back-navigation link to the admin dashboard.",
  "frontend/src/pages/SalesPage.tsx": "Page that displays the TodaysSalesPanel component with a header and back-navigation link to the admin dashboard.",
  "frontend/src/pages/SalesReports.tsx": "Empty page component file for the Sales Reports page.",
  "frontend/src/pages/StockManagement.tsx": "Full-page React component for managing inventory stock items, supporting search, add, edit, delete, trending toggle, and sale recording via query hooks and dialogs.",
  "frontend/src/pages/TrendingPage.tsx": "Simple page component that displays trending products using TrendingStocksPanel, with a back-to-dashboard link and header.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based design tokens, custom color palettes (forest, gold, amber), typography, border radius, and shadow utilities.",
  "project_state.json": "Project state metadata tracking existing features, known issues (mobile sidebar overlap), and pending feature requests for the Bevinamarada Ayurvedic Store dashboard."
}