{
  "kind": "build_request",
  "title": "Fix slow admin panel loading and update store location",
  "projectName": "Bevinamarada Ayurvedic Store",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Optimize the AdminGuard component to reduce loading time after login. Eliminate unnecessary sequential async operations by parallelizing the Internet Identity authentication check, actor initialization, and profile/role fetches using Promise.all where possible. Add loading skeleton or spinner feedback so the UI is responsive immediately while data loads in the background rather than showing a blank screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It's too loding after login Admin control. Fix it and make faster loding."
        ]
      },
      "acceptanceCriteria": [
        "The admin panel becomes interactive (shows layout/skeleton) within 1–2 seconds of successful login instead of hanging on a blank screen.",
        "Authentication, actor creation, and profile queries are run in parallel where dependencies allow.",
        "A loading spinner or skeleton is visible immediately after login while data is being fetched.",
        "No regression in admin route protection — unauthenticated users are still redirected to /admin-login."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Optimize the OwnerDashboard and AdminDashboard pages to use stale-while-revalidate caching via React Query (set appropriate staleTime and cacheTime on queries in useQueries.ts) so that repeated visits to the admin panel do not trigger full refetches every time, reducing perceived load time.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix it and make faster loding."
        ]
      },
      "acceptanceCriteria": [
        "React Query hooks for stock items, sales data, and trial status have a staleTime of at least 30 seconds.",
        "Navigating back to the dashboard after visiting a sub-page does not trigger a full loading spinner — cached data is shown immediately.",
        "Background refetches still occur to keep data fresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the store location in the Contact page (frontend/src/pages/Contact.tsx) to use the new Google Maps link: https://maps.app.goo.gl/T6HCLQMn9kQqAW8x6?g_st=aw. Replace the existing embedded Google Maps iframe src and any hardcoded map links with this new location URL. Use the embeddable version of this map link for the iframe and the direct link for any 'Get Directions' or 'View on Map' anchor tags.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "edit store location (https://maps.app.goo.gl/T6HCLQMn9kQqAW8x6?g_st=aw)"
        ]
      },
      "acceptanceCriteria": [
        "The embedded Google Maps iframe on the Contact page points to the new location https://maps.app.goo.gl/T6HCLQMn9kQqAW8x6.",
        "Any 'Get Directions' or external map link on the Contact page uses the new URL.",
        "The map renders correctly in the iframe without broken content or CORS errors."
      ]
    }
  ],
  "constraints": [
    "Do not change hardcoded admin credentials or session logic in AdminLogin.tsx.",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Backend data model and Motoko actor must not be changed."
  ],
  "nonGoals": [
    "Adding server-side caching or backend performance changes.",
    "Redesigning the admin UI layout or visual theme.",
    "Changing the authentication mechanism (Internet Identity stays as-is).",
    "Adding real-time data sync or WebSocket support."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}