{
  "kind": "build_request",
  "title": "Switch to Pharma Theme, Fix Contrast Issues, Update Admin Credentials",
  "projectName": "Bevinamarada Ayurvedic Store",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the entire cyber/neon dark theme with a clean, professional pharma-grade UI theme. The new theme should use a light, clinical color palette (e.g., white, soft greens, muted teals, light grays, and accent blues typical of pharmaceutical/health brands). Remove all neon glows, scanline effects, grid backgrounds, neonFlicker/pulseGlow animations, and neon border utilities. Update frontend/index.css, frontend/src/index.css, and frontend/tailwind.config.js to reflect the new pharma color tokens, removing all neon-specific utilities and cyber-style design tokens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "i don't want this cyber theme. i want pharma theme and high rated UI"
        ]
      },
      "acceptanceCriteria": [
        "No neon glow effects, scanlines, or cyber grid backgrounds are visible anywhere in the app",
        "The app uses a light, professional pharma-inspired color palette consistently across all pages",
        "All Tailwind config neon color tokens and animations (pulseGlow, neonFlicker) are replaced with pharma-appropriate tokens",
        "The visual style is consistent and polished across public pages and admin pages"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current font stack (Orbitron, Rajdhani, Share Tech Mono — cyber/sci-fi fonts) with pharma-appropriate professional fonts. Use a clean sans-serif combination such as Inter or Nunito for body text and DM Sans or Poppins for headings. Update the Google Fonts import in frontend/src/index.css and the fontFamily configuration in frontend/tailwind.config.js accordingly. Apply the new fonts globally across all pages and components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "change font style",
          "i want pharma theme and high rated UI"
        ]
      },
      "acceptanceCriteria": [
        "Orbitron, Rajdhani, and Share Tech Mono fonts are no longer used anywhere",
        "A clean, readable pharma-appropriate font is applied consistently across all headings and body text",
        "Font imports in index.css are updated to the new font families"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix all text and UI contrast issues where text color blends into or is not readable against the background. Audit and update text colors across all pages and components — including AdminDashboard, OwnerDashboard, StockManagement, CustomerManagement, ProductManagement, SalesReports, AdminLogin, Home, and all admin layout components — to ensure sufficient contrast ratios (WCAG AA minimum). All headings, labels, table text, card text, button labels, and form field text must be clearly legible against their respective backgrounds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "some UI AND text colour mixed with background and didn't showing properly"
        ]
      },
      "acceptanceCriteria": [
        "No text is invisible or hard to read against its background in any page or component",
        "All card, table, form, and nav text is clearly visible with appropriate contrast",
        "Dark text is used on light backgrounds and vice versa consistently throughout"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the 'Add Items' (StockItemForm dialog / StockManagement page) and 'Add Customer' (CustomerManagement page) UI elements that overlap with background content. Ensure modal/dialog backdrops are fully opaque with a proper overlay, dialog containers have solid white or light-colored backgrounds with visible borders or shadows, and z-index layering is correct so dialogs render fully above all page content. Apply the same fix to any other dialog or overlay in the admin panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add items and add costomer option overlaps with background"
        ]
      },
      "acceptanceCriteria": [
        "The 'Add Items' dialog renders fully above the stock management page content with a solid background",
        "The 'Add Customer' dialog renders fully above the customer management page content with a solid background",
        "Modal backdrops dim the content behind them and dialogs are fully legible",
        "No UI element bleeds through or behind any dialog/modal"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the admin login credentials in frontend/src/pages/AdminLogin.tsx. Change the hardcoded username from 'admin' to 'baslxr' and the hardcoded password from 'admin123' to 'bas12345'. Ensure the login page UI matches the new pharma theme with proper contrast and readable form fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "admin portal login username is baslxr and password is bas12345"
        ]
      },
      "acceptanceCriteria": [
        "Logging in with username 'baslxr' and password 'bas12345' successfully authenticates and redirects to the owner dashboard",
        "Logging in with the old credentials 'admin' / 'admin123' fails authentication",
        "The admin login page is styled with the new pharma theme"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Apply the pharma theme consistently to all public-facing pages (Home, Products, AboutUs, Contact) and all admin pages (OwnerDashboard, AdminDashboard, StockManagement, ProductManagement, CustomerManagement, EnquiryManagement, SalesReports, SalesPage, RevenuePage, IncomePage, TrendingPage, ProfilePage). Use consistent card styles with white/light backgrounds, subtle box shadows, rounded corners, and clear section separation. Navigation headers and sidebars should use the pharma color palette with proper contrast for all nav labels and icons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "i want pharma theme and high rated UI"
        ]
      },
      "acceptanceCriteria": [
        "All pages consistently use the pharma color palette, typography, and card/layout styles",
        "The public header/navigation is clean and professional with readable links",
        "The admin sidebar and all admin page layouts use the pharma theme without any remaining neon or cyber styling",
        "Cards, tables, buttons, and forms across all pages have a cohesive, high-quality pharma aesthetic"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ (useActor.ts, useInternetIdentity.ts) or frontend/src/main.tsx",
    "Do not modify files under frontend/src/components/ui/",
    "Backend logic and data models must not be changed",
    "Admin credentials must be exactly: username 'baslxr', password 'bas12345'"
  ],
  "nonGoals": [
    "Redesigning or changing any backend API or data schema",
    "Adding new backend features or routes",
    "Implementing real authentication (credentials remain hardcoded in the frontend)",
    "Adding new pages or features beyond what exists",
    "Internet Identity or any third-party auth changes"
  ],
  "imageRequirements": {
    "required": [
      "Clean pharma-style logo mark — a green cross or leaf combined with a minimalist pill or mortar icon, suitable for a light white header background (pharma-logo.dim_200x60.png)",
      "Soft light green and white abstract background pattern with subtle medical/herbal motifs for hero section (pharma-hero-bg.dim_1440x600.png)"
    ],
    "edits": []
  }
}