{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Optimize admin panel loading and update store location",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Optimize AdminGuard component to reduce loading time after login by parallelizing authentication checks and adding loading feedback",
      "acceptanceCriteria": [
        "The admin panel becomes interactive (shows layout/skeleton) within 1–2 seconds of successful login instead of hanging on a blank screen.",
        "Authentication, actor creation, and profile queries are run in parallel where dependencies allow.",
        "A loading spinner or skeleton is visible immediately after login while data is being fetched.",
        "No regression in admin route protection — unauthenticated users are still redirected to /admin-login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "Refactor AdminGuard to parallelize independent async operations using Promise.all. Currently, the component performs sequential checks (session validation, Internet Identity auth, actor initialization, profile fetch, admin check). Parallelize the profile fetch and admin role check since both depend only on the actor being ready. Add an immediate loading skeleton/spinner UI that displays while authentication and data fetching occur in the background, preventing the blank screen issue. Ensure the session check and redirect logic remain intact to protect admin routes from unauthenticated access."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Optimize OwnerDashboard and AdminDashboard pages with stale-while-revalidate caching to reduce repeated refetches",
      "acceptanceCriteria": [
        "React Query hooks for stock items, sales data, and trial status have a staleTime of at least 30 seconds.",
        "Navigating back to the dashboard after visiting a sub-page does not trigger a full loading spinner — cached data is shown immediately.",
        "Background refetches still occur to keep data fresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add stale-while-revalidate caching configuration to all React Query hooks used by OwnerDashboard and AdminDashboard. Set staleTime to 30 seconds (30000ms) and cacheTime to 5 minutes (300000ms) for queries including useGetAllStockItems, useGetLowStockItems, useGetTrendingStockItems, useGetTodaysSales, useGetSalesReports, and useGetTrialStatus. This ensures that repeated visits to the dashboard show cached data immediately while background refetches keep data fresh, reducing perceived load time."
        },
        {
          "path": "frontend/src/pages/OwnerDashboard.tsx",
          "operation": "modify",
          "description": "Verify that the OwnerDashboard properly displays cached data from React Query hooks when navigating back from sub-pages. Ensure loading states only show when data is truly being fetched for the first time or when cache has expired, not on every navigation. The updated staleTime configuration in useQueries.ts will handle the caching behavior automatically."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Verify that the AdminDashboard properly displays cached data from React Query hooks when navigating back from sub-pages. Ensure the dashboard cards remain interactive and show cached data immediately. The updated staleTime configuration in useQueries.ts will handle the caching behavior automatically."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the store location on the Contact page to use the new Google Maps link",
      "acceptanceCriteria": [
        "The embedded Google Maps iframe on the Contact page points to the new location https://maps.app.goo.gl/T6HCLQMn9kQqAW8x6.",
        "Any 'Get Directions' or external map link on the Contact page uses the new URL.",
        "The map renders correctly in the iframe without broken content or CORS errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Replace the existing Google Maps iframe src with the embeddable version of the new location URL https://maps.app.goo.gl/T6HCLQMn9kQqAW8x6. Convert the shortened Google Maps link to the proper embed format by constructing an iframe-compatible URL (e.g., https://www.google.com/maps/embed?pb=... or using the Place ID from the short link). Update any 'Get Directions' or 'View on Map' anchor tags to use the direct link https://maps.app.goo.gl/T6HCLQMn9kQqAW8x6?g_st=aw. Ensure the iframe renders without CORS errors and displays the correct store location."
        }
      ]
    }
  ]
}