{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Switch to Pharma Theme, Fix Contrast Issues, Update Admin Credentials",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace cyber/neon dark theme with clean pharma-grade UI theme using light clinical color palette",
      "acceptanceCriteria": [
        "No neon glow effects, scanlines, or cyber grid backgrounds are visible anywhere in the app",
        "The app uses a light, professional pharma-inspired color palette consistently across all pages",
        "All Tailwind config neon color tokens and animations (pulseGlow, neonFlicker) are replaced with pharma-appropriate tokens",
        "The visual style is consistent and polished across public pages and admin pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove all neon-specific CSS utilities including neonGlow, neonBorder, neonText, scanlines, gridBackground, pulseGlow, and neonFlicker animations. Replace the dark neon color scheme with pharma-appropriate light colors (white backgrounds, soft greens, muted teals, light grays, accent blues). Remove Google Fonts import for Orbitron, Rajdhani, and Share Tech Mono. Keep Tailwind directives (@tailwind base, components, utilities) intact."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Replace the neon dark color tokens (neon greens, black surfaces) with pharma-grade light color palette tokens (white, soft green, muted teal, light gray, accent blue). Remove custom neon glow box shadows and replace with subtle professional shadows. Remove pulseGlow and neonFlicker keyframe animations. Update fontFamily to use pharma-appropriate fonts (Inter/Nunito for body, DM Sans/Poppins for headings) instead of Orbitron, Rajdhani, and Share Tech Mono."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Update OKLCH-based CSS custom property design tokens to use a light pharma color scheme. Replace dark theme tokens with light clinical colors (white, soft greens, muted teals, light grays, accent blues). Ensure the light theme is applied globally as the default. Remove any dark theme or neon-specific token definitions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace cyber/sci-fi fonts with professional pharma-appropriate sans-serif fonts",
      "acceptanceCriteria": [
        "Orbitron, Rajdhani, and Share Tech Mono fonts are no longer used anywhere",
        "A clean, readable pharma-appropriate font is applied consistently across all headings and body text",
        "Font imports in index.css are updated to the new font families"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Replace Google Fonts import for Orbitron, Rajdhani, and Share Tech Mono with pharma-appropriate fonts: Inter or Nunito for body text and DM Sans or Poppins for headings. Update the @import url() statement at the top of the file to load the new font families from Google Fonts."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update the fontFamily configuration in the theme.extend section to use the new pharma fonts. Set 'sans' to use Inter or Nunito as the default body font stack, and configure heading font keys (if any) to use DM Sans or Poppins. Remove all references to Orbitron, Rajdhani, and Share Tech Mono."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix text and UI contrast issues to ensure all text is clearly readable against backgrounds",
      "acceptanceCriteria": [
        "No text is invisible or hard to read against its background in any page or component",
        "All card, table, form, and nav text is clearly visible with appropriate contrast",
        "Dark text is used on light backgrounds and vice versa consistently throughout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Update text colors to ensure sufficient contrast against the pharma light background. Replace any dark text classes with readable colors (e.g., dark gray or black text on white/light green cards). Ensure all navigation card titles, descriptions, and icons have appropriate contrast ratios (WCAG AA minimum)."
        },
        {
          "path": "frontend/src/pages/OwnerDashboard.tsx",
          "operation": "modify",
          "description": "Update metric cards and navigation link text colors for proper contrast against light pharma backgrounds. Ensure stat numbers, labels, and all text elements are clearly legible with dark text on light backgrounds."
        },
        {
          "path": "frontend/src/pages/StockManagement.tsx",
          "operation": "modify",
          "description": "Fix contrast for table headers, row text, search input, tab labels, and action button text. Use dark text on light backgrounds throughout. Ensure the data table, filter tabs, and all interactive elements have readable text with appropriate contrast."
        },
        {
          "path": "frontend/src/pages/ProductManagement.tsx",
          "operation": "modify",
          "description": "Update table text, action button labels, search input, and column headers to use dark text on light backgrounds. Ensure all product data, action icons, and form labels are clearly visible with sufficient contrast."
        },
        {
          "path": "frontend/src/pages/CustomerManagement.tsx",
          "operation": "modify",
          "description": "Fix contrast for customer table rows, tab labels, search input, form fields, and action buttons. Use dark text on light card backgrounds. Ensure all customer data, visit counts, and enquiry text are legible."
        },
        {
          "path": "frontend/src/pages/SalesReports.tsx",
          "operation": "modify",
          "description": "Update chart labels, summary cards, tab navigation, and table text to ensure proper contrast against light backgrounds. Use dark text consistently for all sales data, revenue figures, and analytics displays."
        },
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Update form field labels, input text, button text, and error messages to use colors with appropriate contrast against the pharma light background. Ensure username/password fields and the login button are clearly readable."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Fix contrast for hero section headings, CTAs, trust indicators, stat labels, and all text overlays. Use dark text on light backgrounds or ensure sufficient contrast for any text over the pharma hero background image (frontend/public/assets/generated/pharma-hero-bg.dim_1440x600.png). Replace the hero background reference with the new pharma hero background."
        },
        {
          "path": "frontend/src/components/AdminLayout.tsx",
          "operation": "modify",
          "description": "Update sidebar navigation link text, icons, and active state indicators to ensure proper contrast against the pharma light sidebar background. Use dark text for all nav labels and ensure the mobile drawer has readable text as well."
        },
        {
          "path": "frontend/src/components/PublicLayout.tsx",
          "operation": "modify",
          "description": "Fix header and navigation link text colors for proper contrast against the pharma light header background. Update the logo image reference to use the new pharma logo (frontend/public/assets/generated/pharma-logo.dim_200x60.png). Ensure mobile menu text and all nav elements are clearly visible."
        },
        {
          "path": "frontend/src/components/TodaysSalesPanel.tsx",
          "operation": "modify",
          "description": "Update stat card text, table headers, and row text to use dark colors on light backgrounds. Ensure all sales figures, transaction details, and labels have sufficient contrast."
        },
        {
          "path": "frontend/src/components/RevenueOverview.tsx",
          "operation": "modify",
          "description": "Fix contrast for revenue stat cards and the top-products table. Use dark text on light card backgrounds. Ensure all revenue figures and product breakdown text are clearly legible."
        },
        {
          "path": "frontend/src/components/IncomeTracking.tsx",
          "operation": "modify",
          "description": "Update income stat cards and monthly breakdown table text to ensure proper contrast against light pharma backgrounds. Use dark text consistently for all income figures and labels."
        },
        {
          "path": "frontend/src/components/TrendingProducts.tsx",
          "operation": "modify",
          "description": "Fix contrast for product card titles, prices, and enquiry link text. Ensure all trending product information is readable against the pharma light card backgrounds."
        },
        {
          "path": "frontend/src/components/TrendingStocksPanel.tsx",
          "operation": "modify",
          "description": "Update trending stock card text (category, price, stock quantity) to use dark text on light backgrounds. Ensure all product details are clearly visible."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix 'Add Items' and 'Add Customer' dialog/modal overlaps by ensuring proper backdrop, z-index, and solid backgrounds",
      "acceptanceCriteria": [
        "The 'Add Items' dialog renders fully above the stock management page content with a solid background",
        "The 'Add Customer' dialog renders fully above the customer management page content with a solid background",
        "Modal backdrops dim the content behind them and dialogs are fully legible",
        "No UI element bleeds through or behind any dialog/modal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StockItemForm.tsx",
          "operation": "modify",
          "description": "Ensure the dialog/modal has a fully opaque backdrop overlay (e.g., bg-black/50 or bg-gray-900/50) and the dialog container has a solid white or light pharma-colored background (bg-white or bg-gray-50). Verify z-index layering is correct (typically z-50 for dialog, z-40 for backdrop) so the dialog renders fully above all page content. Add visible borders or box shadows to the dialog container for clear separation."
        },
        {
          "path": "frontend/src/pages/CustomerManagement.tsx",
          "operation": "modify",
          "description": "Ensure the 'Add Customer' dialog/modal has a fully opaque backdrop overlay and a solid white or light-colored background. Verify z-index layering so the dialog renders above all customer management page content. Add borders or shadows to the dialog for visual clarity. Apply the same fixes to any other dialog or overlay used in customer management."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update admin login credentials from admin/admin123 to baslxr/bas12345",
      "acceptanceCriteria": [
        "Logging in with username 'baslxr' and password 'bas12345' successfully authenticates and redirects to the owner dashboard",
        "Logging in with the old credentials 'admin' / 'admin123' fails authentication",
        "The admin login page is styled with the new pharma theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Change the hardcoded username validation from 'admin' to 'baslxr' and the hardcoded password validation from 'admin123' to 'bas12345'. Ensure the login form UI uses the new pharma theme colors, fonts, and proper contrast for all form fields, labels, buttons, and error messages. Update any placeholder text or help text to reflect the new credentials if appropriate."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Apply pharma theme consistently across all public and admin pages with unified card styles, navigation, and layout",
      "acceptanceCriteria": [
        "All pages consistently use the pharma color palette, typography, and card/layout styles",
        "The public header/navigation is clean and professional with readable links",
        "The admin sidebar and all admin page layouts use the pharma theme without any remaining neon or cyber styling",
        "Cards, tables, buttons, and forms across all pages have a cohesive, high-quality pharma aesthetic"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Apply the pharma theme to the hero section, trust indicators, stats, and CTAs. Use white or light pharma-colored card backgrounds with subtle box shadows and rounded corners. Replace any neon styling with clean pharma design tokens. Wire in the generated pharma hero background image (frontend/public/assets/generated/pharma-hero-bg.dim_1440x600.png) as the hero section background. Ensure consistent use of the pharma color palette and typography."
        },
        {
          "path": "frontend/src/pages/Products.tsx",
          "operation": "modify",
          "description": "Update the placeholder 'coming soon' message to use pharma theme styling with light backgrounds, professional fonts, and appropriate card styling. Ensure consistency with the rest of the app."
        },
        {
          "path": "frontend/src/pages/AboutUs.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the hero section, company story, and core values grid. Use white or light pharma card backgrounds, professional fonts, and subtle shadows. Ensure all icons, headings, and text follow the pharma color palette and typography."
        },
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the contact info section, map container, and enquiry form. Use light card backgrounds, professional styling, and ensure form fields have proper borders and readable labels. Update button styling to match the pharma theme."
        },
        {
          "path": "frontend/src/pages/OwnerDashboard.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to all metric cards, navigation links, and the low-stock alert banner. Use white or light pharma backgrounds, subtle shadows, rounded corners, and consistent typography. Remove any remaining neon or cyber styling."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to all navigation cards. Use white or light pharma card backgrounds with subtle box shadows and rounded corners. Update card titles, descriptions, and icons to use pharma colors and fonts. Remove all neon effects."
        },
        {
          "path": "frontend/src/pages/StockManagement.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the page layout, filter tabs, search bar, data table, and action buttons. Use light card backgrounds, professional table styling with borders, and ensure all UI elements follow the pharma color palette and typography. Remove any neon or cyber styling."
        },
        {
          "path": "frontend/src/pages/ProductManagement.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the product table, search bar, and action buttons. Use white or light card backgrounds, professional table styling, and consistent pharma fonts and colors. Remove any neon effects."
        },
        {
          "path": "frontend/src/pages/CustomerManagement.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to customer tabs, table, search bar, and forms. Use light pharma card backgrounds, professional table styling, and ensure all buttons, inputs, and labels follow the pharma aesthetic. Remove neon styling."
        },
        {
          "path": "frontend/src/pages/EnquiryManagement.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the enquiry tabs and table. Use light card backgrounds, professional table styling, and consistent pharma colors and fonts. Remove any neon effects."
        },
        {
          "path": "frontend/src/pages/SalesReports.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to sales analytics tabs, summary cards, charts, and the export button. Use white or light pharma card backgrounds, professional chart styling, and consistent typography. Remove neon effects."
        },
        {
          "path": "frontend/src/pages/SalesPage.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the page layout and back-navigation header. Ensure the TodaysSalesPanel component inherits the pharma styling."
        },
        {
          "path": "frontend/src/pages/RevenuePage.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the page layout and back-navigation header. Ensure the RevenueOverview component inherits the pharma styling."
        },
        {
          "path": "frontend/src/pages/IncomePage.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the page layout and back-navigation header. Ensure the IncomeTracking component inherits the pharma styling."
        },
        {
          "path": "frontend/src/pages/TrendingPage.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the page layout and back-navigation header. Ensure the TrendingStocksPanel component inherits the pharma styling."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the user profile form. Use light card backgrounds, professional form styling, and ensure all inputs, labels, and buttons follow the pharma color palette and typography."
        },
        {
          "path": "frontend/src/components/PublicLayout.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the public header, desktop nav links, and mobile menu overlay. Use a clean white or light pharma header background, professional fonts, and ensure all nav links are styled consistently. Wire in the generated pharma logo (frontend/public/assets/generated/pharma-logo.dim_200x60.png) in place of any existing logo. Remove any neon or cyber styling."
        },
        {
          "path": "frontend/src/components/AdminLayout.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the admin sidebar navigation and mobile drawer. Use light pharma backgrounds, professional fonts, and ensure all nav links, icons, and the logout button follow the pharma aesthetic. Remove neon effects."
        },
        {
          "path": "frontend/src/components/LowStockWarning.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the alert banner. Use a light pharma-colored alert background (e.g., soft yellow or orange for warnings), readable dark text, and professional styling with rounded corners and subtle borders."
        },
        {
          "path": "frontend/src/components/TrendingProducts.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the trending products grid. Use white or light pharma card backgrounds, professional card styling with rounded corners and subtle shadows, and ensure product titles, prices, and links follow the pharma typography and colors."
        },
        {
          "path": "frontend/src/components/TrendingStocksPanel.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the trending stocks card grid. Use light pharma card backgrounds, professional styling, and consistent fonts and colors for product details."
        },
        {
          "path": "frontend/src/components/TodaysSalesPanel.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the sales stat cards and transactions table. Use white or light pharma card backgrounds, professional table styling, and consistent typography. Remove neon effects."
        },
        {
          "path": "frontend/src/components/RevenueOverview.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to revenue cards and the top-products table. Use light pharma card backgrounds, professional table styling, and consistent fonts and colors."
        },
        {
          "path": "frontend/src/components/IncomeTracking.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to income stat cards and the monthly breakdown table. Use white or light pharma card backgrounds, professional table styling, and consistent typography."
        },
        {
          "path": "frontend/src/components/StockItemForm.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the stock item dialog form. Use a solid white or light pharma background for the dialog, professional form field styling, readable labels, and ensure buttons follow the pharma aesthetic. Ensure proper contrast for all form elements."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Apply pharma theme to the profile setup modal. Use a solid white or light pharma background, professional form styling, and ensure the modal has proper backdrop and z-index layering consistent with the pharma aesthetic."
        }
      ]
    }
  ]
}