{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix mobile navigation menu overlay behavior",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rebuild the mobile navigation menu in PublicLayout.tsx as a proper full-screen overlay drawer that completely covers the viewport with a solid background",
      "acceptanceCriteria": [
        "On mobile viewports, tapping the hamburger icon opens a full-screen overlay that completely covers the viewport.",
        "No background page content (e.g., Admin Login, Why Choose Bevinamarada sections) is visible through or behind the open menu.",
        "The overlay has a solid opaque background consistent with the site's Ayurvedic green/brown theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublicLayout.tsx",
          "operation": "modify",
          "description": "Refactor the mobile menu implementation to render as a full-screen overlay drawer. Apply position: fixed, top-0, left-0, width: 100vw, height: 100vh with a solid opaque background using the existing Ayurvedic green/brown color tokens from the theme. Ensure the overlay has z-index high enough to cover all page content when open. Replace any existing conditional rendering logic to show the overlay only when the mobile menu state is active."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix the layout of menu items inside the mobile overlay so all navigation links are vertically stacked, centered, and properly spaced without overlapping",
      "acceptanceCriteria": [
        "All menu items are displayed in a single vertical column, centered on screen.",
        "No menu item overlaps with any other menu item, the logo, or the close button.",
        "The 'Our Story' / About link is fully visible and not clipped or hidden."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublicLayout.tsx",
          "operation": "modify",
          "description": "Restructure the menu items container within the mobile overlay to use flexbox with flex-direction: column, items-center, and justify-center. Add adequate vertical spacing (gap or margin) between each navigation link (Home, About, Products, Contact, etc.). Ensure no absolute positioning or negative margins cause overlaps. Verify the logo and close button are positioned outside the scrollable menu items area to prevent collision. Test that the 'Our Story' / About link renders fully visible without clipping."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the close (X) button in the mobile menu fully dismisses the overlay and is clearly positioned in the top-right corner",
      "acceptanceCriteria": [
        "A clearly visible close (X) button is present in the top-right corner of the open mobile menu overlay.",
        "Clicking the X button closes the menu overlay completely.",
        "After closing, the page returns to its normal scrollable state with no residual overlay elements visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublicLayout.tsx",
          "operation": "modify",
          "description": "Position the close (X) button in the top-right corner of the mobile overlay using absolute positioning (e.g., top-4 right-4). Ensure the button's onClick handler sets the mobile menu state to closed. Verify that when the menu state is closed, no overlay DOM elements remain visible or rendered. Style the button to be visually distinct with sufficient size and contrast against the overlay background."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Lock the body scroll when the mobile menu is open and restore normal scroll behavior when closed",
      "acceptanceCriteria": [
        "When the mobile menu is open, the page behind it cannot be scrolled.",
        "When the mobile menu is closed, normal page scrolling resumes immediately.",
        "No layout shift or jump occurs when scroll lock is applied or removed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublicLayout.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that watches the mobile menu open state. When the menu opens, apply 'overflow-hidden' to document.body.style. When the menu closes, restore the original overflow value (or remove the inline style). Ensure cleanup in the useEffect return function to prevent scroll lock from persisting if the component unmounts while the menu is open. Verify no layout shift occurs by preserving scrollbar gutter if needed."
        }
      ]
    }
  ]
}