{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add admin portal login with hardcoded credentials and remember me option",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a standalone admin portal login page with hardcoded credentials (baslxr/bas12345) that authenticates separately from Internet Identity and redirects to admin dashboard on success",
      "acceptanceCriteria": [
        "A login page exists with username and password input fields",
        "Entering username 'baslxr' and password 'bas12345' grants access to the admin area",
        "Entering incorrect credentials shows an error message",
        "Successful login redirects the user to the admin dashboard"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "create",
          "description": "Create a standalone admin login page component with username and password input fields, hardcoded credential validation (baslxr/bas12345), error message display for invalid credentials, and redirect logic to /admin-dashboard on successful authentication. Use form with controlled inputs and leverage existing Tailwind classes and theme colors (saffron, teal) for consistent styling. Store authenticated session state in sessionStorage upon successful login."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new public route for /admin-login that renders the AdminLogin page component. Place this route outside the AdminGuard wrapper so it is accessible without Internet Identity authentication. Ensure the route is registered before the protected admin routes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a 'Remember Me' checkbox that persists credentials to localStorage when checked and pre-fills login fields on subsequent visits",
      "acceptanceCriteria": [
        "A 'Remember Me' checkbox is displayed on the login page",
        "When 'Remember Me' is checked and login is successful, username and password are saved to localStorage",
        "On subsequent visits, the username and password fields are pre-filled from localStorage if saved credentials exist",
        "The 'Remember Me' checkbox is also pre-checked if saved credentials exist",
        "When 'Remember Me' is unchecked on login, any previously saved credentials are removed from localStorage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Add a 'Remember Me' checkbox to the login form. On component mount, check localStorage for saved credentials (keys: 'adminUsername', 'adminPassword', 'adminRememberMe') and pre-fill the username and password fields if they exist, also checking the checkbox. On successful login, if 'Remember Me' is checked, save the username and password to localStorage; if unchecked, clear any previously saved credentials from localStorage. Handle the checkbox state and implement the save/clear logic in the form submission handler."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Protect all existing admin routes by checking session authentication state and redirecting unauthenticated users to the admin login page, with session persistence via sessionStorage",
      "acceptanceCriteria": [
        "Navigating directly to any admin route without being logged in redirects to the admin login page",
        "After login, navigating to admin routes works without re-authentication within the same session",
        "A logout button in the admin layout clears the session and redirects to the login page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "Add session authentication check at the top of the AdminGuard component before the Internet Identity authentication logic. Check sessionStorage for 'adminSessionActive' key. If not present or false, redirect to /admin-login using the router's navigate function. If session is active, proceed with existing Internet Identity and profile setup flow. Do not remove or alter the existing Internet Identity integration; only add the session check as a preliminary gate."
        },
        {
          "path": "frontend/src/components/AdminLayout.tsx",
          "operation": "modify",
          "description": "Add a 'Logout from Admin Portal' button in the profile dropdown menu (or as a separate visible logout button in the sidebar). On click, clear the 'adminSessionActive' key from sessionStorage and navigate to /admin-login. Keep the existing Internet Identity logout button unchanged. Ensure both logout mechanisms are clearly labeled and do not interfere with each other."
        }
      ]
    }
  ]
}